package yrHw2;

import java.util.Scanner;

/**
 * Задание 3
 * Создать программу, выводящую на экран ближайшее к 10 из двух чисел, введенных с консоли.
 * Например, среди чисел 8,5 и 11,45 ближайшее к десяти 11,45.
 */

public class Task3 {

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.println("Please, enter number one: ");
        double valueFromConsoleOne = scanner.nextDouble();
        System.out.println("Please, enter number two: ");
        double valueFromConsoleTwo = scanner.nextDouble();




    }
}
