package hw5;

/**
 * Вывести в консоль все парные числа одномерного массива.
 Вывести все числа одномерного массива в обратном порядке.
 Вывести первую и вторую половину одномерного массива.
 Вывести первую и вторую половину одномерного массива в обратном порядке.
 Найти сумму всех элементов в массиве.
 Найти среднеарифметическое всех чисел массива.
 Найти минимальное и максимальное число в массиве.
 Заменить все отрицательные числа в массиве на 0.
 Подсчитать одинаковые числа в одномерном массиве.
 Поменять минимальное и максимальное числа в массиве местами.
 Инвертировать массив.
 Вывести в консоль половину массива, среднеарифметическое которых является большим.
 Найти сумму отрицательных чисел в одномерном массиве.
 Дан массив чисел, среди которых имеется один ноль. Вывести на печать все числа до нуля включительно.
 Написать программу, меняющую местами два наибольших элемента одномерного массива с первым и последним.
 Написать программу, которая выводит на экран элементы одномерного массива, которые расположены до минимального элемента всего массива.
 Найти сумму всех чисел находящихся между минимальным и максимальным числом в массиве.
 Вывести в консоль половину массива в которой находиться наименьшее число массива.
 Написать программу, которая перемещает в конец массива все элементы, значения которых находится в отрезке [a,b].
 */

public class Hw5 {
    public static void main(String[] args) {

    }

    // Вывести в консоль все парные числа одномерного массива.
    protected static void allDoNot(){

    }

}
