package hw6;

/**
 * Написать метод, который будет генерировать пароль(String) заданной длины(аргумент метода) из символов a-z A-Z 0-9.
 * Написать метод, который вычисляет максимальную по длине общую подстроку из двух переданных строк(аргументы метода).
 */
public class hw6 {
    public static void main(String[] args) {
        // Написать метод, который будет генерировать пароль(String) заданной длины(аргумент метода) из символов a-z A-Z 0-9.

        // Написать метод, который вычисляет максимальную по длине общую подстроку из двух переданных строк(аргументы метода).

    }

    // Написать метод, который будет генерировать пароль(String) заданной длины(аргумент метода) из символов a-z A-Z 0-9.

    // Написать метод, который вычисляет максимальную по длине общую подстроку из двух переданных строк(аргументы метода).

}
