package hw3;

public class HomeWork3 {
    public static void main(String[] args){

//        System.out.println("1. Создайте программу, выводящую на экран все четырёхзначные числа последовательности 1000 1003 1006 1009 1012 1015 ….");
//        for(int i = 1000; i <= 9999; i += 3){
//            System.out.println(i);
//        }
//
//        System.out.println("2. Создайте программу, выводящую на экран первые 55 элементов последовательности 1 3 5 7 9 11 13 15 17 ….");
//        for(int a = 1; a <= 55; a++){
//            System.out.println(a);
//        }
//
//        System.out.println("3. Создайте программу, выводящую на экран все неотрицательные элементы последовательности 90 85 80 75 70 65 60 ….");
//        for(int b = 90; b >= 0; b -= 5){
//            System.out.println(b);
//        }
//
        System.out.println("4. Создайте программу, выводящую на экран первые 20 элементов последовательности 2 4 8 16 32 64 128 ….");

    }
}
