/*      Используя IntelliJ IDEA, создайте класс Calculator.
        Напишите программу - консольный калькулятор.
        Введите с консоли две переменные. Предложите
        пользователю ввести знак арифметической операции.
        Для организации выбора алгоритма вычислительного
        процесса, используйте оператор switch. Выведите на
        экран результат выполнения арифметической операции.
        В случае использования операции деления, организуйте
        проверку попытки деления на ноль. И если таковая имеется,
        то отмените выполнение арифметической операции и уведомите
        об ошибке пользователя
*/

package hw2; // TODO: 24.09.2017

import java.util.Scanner;

public class Calculator {
    public static void main(String[] args) {

        Scanner scan = new Scanner(System.in);


    }
}
