/*
        Используя IntelliJ IDEA, создайте класс Interval.
        Напишите программу определения, попадает ли
        введенное пользователем число от 0 до 100 в числовой
        промежуток [0 - 14] [15 - 35] [36 - 50] [50 - 100].
        Если да, то укажите, в какой именно промежуток.
        Если пользователь указывает число не входящее ни в
        один из имеющихся числовых промежутков, то выводится
        соответствующее сообщение.
*/

package hw2; // TODO: 24.09.2017

import java.util.Scanner;

public class Interval {
    public static void main(String[] args) {

        Scanner scan = new Scanner(System.in);









    }
}
